GzBicq/invensense_imu_stm32_project/Src/imu_driver/imu_drivert_core/dGyro.c



#if 0

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "stm32f4xx_hal.h"
#include "imu_driver_i2c.h"
#include "imu_driver_uart.h"

#include "inv_mpu.h"
#include "inv_mpu_dmp_motion_driver.h"
#include "invensense.h"
#include "invensense_adv.h"
#include "eMPL_outputs.h"
#include "mltypes.h"
#include "mpu.h"
#include "log.h"
#include "packet.h"

#include "math.h"
#include "dGyro.h"
/* Private typedef -----------------------------------------------------------*/
/* Data read from MPL. */
#define PRINT_ACCEL     (0x01)
#define PRINT_GYRO      (0x02)
#define PRINT_QUAT      (0x04)
#define PRINT_COMPASS   (0x08)
#define PRINT_EULER     (0x10)
#define PRINT_ROT_MAT   (0x20)
#define PRINT_HEADING   (0x40)
#define PRINT_PEDO      (0x80)
#define PRINT_LINEAR_ACCEL  (0x100)
#define PRINT_GRAVITY_VECTOR (0x200)

volatile uint32_t hal_timestamp = 0;
#define ACCEL_ON        (0x01)
#define GYRO_ON         (0x02)
#define COMPASS_ON      (0x04)

#define MOTION          (0)
#define NO_MOTION       (1)

/* Starting sampling rate. */
#define DEFAULT_MPU_HZ  (10)

#define FLASH_SIZE      (512)
#define FLASH_MEM_START ((void*)0x1800)

#define PEDO_READ_MS    (1000)
#define TEMP_READ_MS    (500)
#define COMPASS_READ_MS (100)
struct rx_s {
    unsigned char header[3];
    unsigned char cmd;
};
struct hal_s {
    unsigned char lp_accel_mode;
    unsigned char sensors;
    unsigned char dmp_on;
    unsigned char wait_for_tap;
    volatile unsigned char new_gyro;
    unsigned char motion_int_mode;
    unsigned long no_dmp_hz;
    unsigned long next_pedo_ms;
    unsigned long next_temp_ms;
    unsigned long next_compass_ms;
    unsigned int report;
    unsigned short dmp_features;
    struct rx_s rx;
};
static struct hal_s hal = {0};
/* USB RX binary semaphore. Actually, it's just a flag. Not included in struct
 * because it's declared extern elsewhere.
 */
volatile unsigned char rx_new;

unsigned char *mpl_key = (unsigned char*)"eMPL 5.1";
bool d_is_lock = false;
/* Platform-specific information. Kinda like a boardfile. */
struct platform_data_s {
    signed char orientation[9];
};

/* The sensors can be mounted onto the board in any orientation. The mounting
 * matrix seen below tells the MPL how to rotate the raw data from the
 * driver(s).
 * TODO: The following matrices refer to the configuration on internal test
 * boards at Invensense. If needed, please modify the matrices to match the
 * chip-to-body matrix for your particular set up.
 */
static struct platform_data_s gyro_pdata = {
    .orientation = { 1, 0, 0,
                     0, 1, 0,
                     0, 0, 1}
};

#if defined MPU9150 || defined MPU9250
static struct platform_data_s compass_pdata = {
    .orientation = { 0, 1, 0,
                     1, 0, 0,
                     0, 0, -1}
};

#define COMPASS_ENABLED 1
#elif defined AK8975_SECONDARY
static struct platform_data_s compass_pdata = {
    .orientation = {-1, 0, 0,
                     0, 1, 0,
                     0, 0,-1}
};
#define COMPASS_ENABLED 1
#elif defined AK8963_SECONDARY
static struct platform_data_s compass_pdata = {
    .orientation = {-1, 0, 0,
                     0,-1, 0,
                     0, 0, 1}
};
#define COMPASS_ENABLED 1
#endif


inv_error_t result;
unsigned char accel_fsr,  new_temp = 0;
unsigned short gyro_rate, gyro_fsr;
unsigned long timestamp;
struct int_param_s int_param;

#ifdef COMPASS_ENABLED
unsigned char new_compass = 0;
unsigned short compass_fsr;
#endif

static void read_from_mpl(D_GyroDataTypeDef *gyro_data)
{
    long msg,data_temp[4];
    int8_t accuracy;
    unsigned long timestamp;
    float float_data[3] = {0};

    if (inv_get_sensor_type_quat(data_temp, &accuracy, (inv_time_t*)&timestamp))
    {

        for(int i = 0; i < 4; i++)
        {
            gyro_data->quat_data[i] = data_temp[i]/65536.f;

        }
        memset(data_temp, 0, sizeof(data_temp));
    }

    if (inv_get_sensor_type_accel(data_temp, &accuracy,
        (inv_time_t*)&timestamp))
    {

        for(int i = 0; i < 3; i++)
        {
            gyro_data->acceleration_speed[i] = data_temp[i]/65536.f;
        }
        memset(data_temp, 0, sizeof(data_temp));
    }

    if (inv_get_sensor_type_gyro(data_temp, &accuracy,
    (inv_time_t*)&timestamp))
    {

        for(int i = 0; i < 3; i++)
        {
            gyro_data->gyro_speed[i] = data_temp[i]/65536.f;

        }
        memset(data_temp, 0, sizeof(data_temp));
    }

    if (inv_get_sensor_type_euler(data_temp, &accuracy,
       (inv_time_t*)&timestamp))
     {
        for(int i = 0; i < 3; i++)
         {
            gyro_data->euler_angle[i] = data_temp[i]/65536.f;
         }
        memset(data_temp, 0, sizeof(data_temp));
     }
#ifdef COMPASS_ENABLED
    if (inv_get_sensor_type_compass(data_temp, &accuracy,
    (inv_time_t*)&timestamp))
    {

       for(int i = 0; i < 3; i++)
       {
            gyro_data->compass[i] = data_temp[i]/65536.f;
       }
       memset(data_temp, 0, sizeof(data_temp));
    }


#endif
#ifdef ALTERNATIVE_FUNCTION


    if (inv_get_sensor_type_rot_mat(data, &accuracy,
    (inv_time_t*)&timestamp))
    {
        eMPL_send_data(PACKET_DATA_ROT, data);
    }

    if (inv_get_sensor_type_heading(data, &accuracy,
    (inv_time_t*)&timestamp))
    {

    }
    if (inv_get_sensor_type_linear_acceleration(float_data, &accuracy, (inv_time_t*)&timestamp))
    {
        MPL_LOGI("Linear Accel: %7.5f %7.5f %7.5f\r\n",
        float_data[0], float_data[1], float_data[2]);
   }

    if (inv_get_sensor_type_gravity(float_data, &accuracy,
    (inv_time_t*)&timestamp))
    {
        MPL_LOGI("Gravity Vector: %7.5f %7.5f %7.5f\r\n",
        float_data[0], float_data[1], float_data[2]);
    }

    unsigned long timestamp;
    get_tick_count(&timestamp);
    if (timestamp > hal.next_pedo_ms)
    {
        hal.next_pedo_ms = timestamp + PEDO_READ_MS;
        unsigned long step_count, walk_time;
        dmp_get_pedometer_step_count(&step_count);
        dmp_get_pedometer_walk_time(&walk_time);
        MPL_LOGI("Walked %ld steps over %ld milliseconds..\n", step_count,
        walk_time);
    }


    /* Whenever the MPL detects a change in motion state, the application can
     * be notified. For this example, we use an LED to represent the current
     * motion state.
     */
    msg = inv_get_message_level_0(INV_MSG_MOTION_EVENT |
            INV_MSG_NO_MOTION_EVENT);
    if (msg)
    {
        if (msg & INV_MSG_MOTION_EVENT)
        {
            MPL_LOGI("Motion!\n");
        }
        else if (msg & INV_MSG_NO_MOTION_EVENT)
        {
            MPL_LOGI("No motion!\n");
        }
    }

#endif
    msg = inv_get_message_level_0(INV_MSG_MOTION_EVENT |
               INV_MSG_NO_MOTION_EVENT);
       if (msg)
       {
           if (msg & INV_MSG_MOTION_EVENT)
           {
               MPL_LOGI("Motion!\n");
           }
           else if (msg & INV_MSG_NO_MOTION_EVENT)
           {
               gyro_data->nomotion = true;
           }
       }

